base/InformationRegisters/бит_НастройкаКонтроляПоСценариям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкаКонтроляПоСценариям</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_НастройкаКонтроляПоСценариям/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда		
		Возврат;		
	КонецЕсли; 
	
	// Проверка на пересчечение интервалов контроля.
	
	МассивСценариев = ЭтотОбъект.ВыгрузитьКолонку("Сценарий");	
	МассивСценариев = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСценариев);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_НастройкаКонтроляПоСценариям.Период,
		|	бит_НастройкаКонтроляПоСценариям.ДатаОкончания
		|ИЗ
		|	РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК бит_НастройкаКонтроляПоСценариям
		|ГДЕ
		|	бит_НастройкаКонтроляПоСценариям.Сценарий = &Сценарий";
		
		Запрос.УстановитьПараметр("Сценарий", Запись.Сценарий);
		
		Результат = Запрос.Выполнить();
		ТаблицаДат = Результат.Выгрузить();
		
		НоваяСтрока = ТаблицаДат.Добавить();
		НоваяСтрока.Период = Запись.Период;
		НоваяСтрока.ДатаОкончания = Запись.ДатаОкончания;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДат.Период,
		|	ТаблицаДат.ДатаОкончания
		|ПОМЕСТИТЬ ПериодыКонтроля
		|ИЗ
		|	&ТаблицаДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыКонтроля.Период,
		|	ПериодыКонтроля.ДатаОкончания,
		|	ПериодыКонтроляКопия.Период КАК ПериодКопия,
		|	ПериодыКонтроляКопия.ДатаОкончания КАК ДатаОкончанияКопия
		|ИЗ
		|	ПериодыКонтроля КАК ПериодыКонтроля
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыКонтроля КАК ПериодыКонтроляКопия
		|		ПО ПериодыКонтроля.Период <> ПериодыКонтроляКопия.Период
		|			И (ПериодыКонтроля.ДатаОкончания >= ПериодыКонтроляКопия.Период
		|					И ПериодыКонтроля.Период <= ПериодыКонтроляКопия.Период
		|					И ПериодыКонтроля.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ПериодыКонтроля.Период <= ПериодыКонтроляКопия.Период
		|					И ПериодыКонтроля.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ПериодыКонтроля.ДатаОкончания >= ПериодыКонтроляКопия.ДатаОкончания
		|					И ПериодыКонтроля.Период <= ПериодыКонтроляКопия.ДатаОкончания
		|					И ПериодыКонтроля.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|					И ПериодыКонтроляКопия.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ПериодыКонтроля.Период <= ПериодыКонтроляКопия.ДатаОкончания
		|					И ПериодыКонтроля.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|					И ПериодыКонтроляКопия.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	(НЕ ПериодыКонтроляКопия.Период ЕСТЬ NULL )
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПериодыКонтроля";
		
		Запрос.УстановитьПараметр("Сценарий", Запись.Сценарий);
		Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);
		
		Результат = Запрос.Выполнить();
		          
		Заголовок = НСтр("ru = 'Проверка интервалов контроля сценария ""%1""'; en = 'Check script monitoring intervals ""%1""'");
		Заголовок = СтрШаблон(Заголовок, Запись.Сценарий);
		ОбщегоНазначения.СообщитьПользователю(Заголовок);
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = НСтр("ru = 'Обнаружено пересечение интервалов контроля [%1,%2] и [%3,%4]'; 
			                      |en = 'The intersection of control intervals [%1,%2] and [%3,%4] was detected'");
			ТекстСообщения = СтрШаблон(ТекстСообщения,
			                           Формат(Выборка.Период			, "ДЛФ=Д; ДП=∞"),
									   Формат(Выборка.ДатаОкончания		, "ДЛФ=Д; ДП=∞"),
									   Формат(Выборка.ПериодКопия		, "ДЛФ=Д; ДП=∞"),
									   Формат(Выборка.ДатаОкончанияКопия, "ДЛФ=Д; ДП=∞"));									   			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);							 
			
		КонецЦикла; 
		
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
